Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: console.log(""); }); // Получение из столбца "CLASS" массива значений let arrayOfColumnValues = Array.from(InputTable.Columns["CLASS"]); // Вывод значений столбца "CLASS" arrayOfColumnValues.forEach((value, index) => {
en: console.log(""); }); // Getting the values array from the "CLASS" column let arrayOfColumnValues = Array.from(InputTable.Columns["CLASS"]); // Outputting the values of the "CLASS" column arrayOfColumnValues.forEach((value, index) => {

source: console.log("Переменная существует");
en: console.log("The variable exists");

source: console.log(index, ":", value); }); // Чтение значений из входной таблицы методом Get for (let i = 0, с = InputTable.RowCount; i < с; i++) {
en: console.log(index, ":", value); }); // Reading the values from the input table using the Get method for (let i = 0, с = InputTable.RowCount; i < с; i++) {

source: console.log(prop); // Вывод свойств переменной for (let prop in InputVariables.Items[0])
en: console.log(prop); // Outputting the variable properties for (let prop in InputVariables.Items[0])

source: console.log(prop); // Проверка существования переменной "MyVar" if (InputVariables.Items.MyVar)
en: console.log(prop); // Check for existence of "MyVar" variable if (InputVariables.Items.MyVar)

source: console.log(variable.Name, " = ", variable.Value); // Получение из объекта Items массива переменных let arrayOfVariables = Array.from(InputVariables.Items); // Вывод значений переменных в консоль arrayOfVariables.forEach(variable => {
en: console.log(variable.Name, " = ", variable.Value); // Getting the variables array from the Items object let arrayOfVariables = Array.from(InputVariables.Items); // Outputting the variables values to the console arrayOfVariables.forEach(variable => {

source: console.log(variable.Name, " = ", variable.Value); }); // Обращение к переменной по имени console.log(InputVariables.Items["Var0"].Value); console.log(InputVariables.Items.Var0.Value); // Вывод свойств переменных for (let prop in InputVariables.Items)
en: console.log(variable.Name, " = ", variable.Value); }); // Access to the variable by name console.log(InputVariables.Items["Var0"].Value); console.log(InputVariables.Items.Var0.Value); // Outputting the variables properties for (let prop in InputVariables.Items)

source: const InputTable: IDataSource; // Источник данных с первого порта const InputTables: IDataSource[]; // Массив входных источников данных const OutputTable: IOutputTable; // Выходной набор данных const InputVariables: IVariables; // Входные переменные // Перечисления, описывающие метаданные полей и переменных enum DataType { None, Boolean, DateTime, Float, Integer, String, Variant } // Тип данных enum DataKind { Undefined, Continuous, Discrete } // Вид данных enum UsageType { Unspecified, Excluded, Useless, Active, // Назначение полей
en: const InputTable: IDataSource; // Source of the data from the first port const InputTables: IDataSource[]; // Array of the input data sources const OutputTable: IOutputTable; // Output data source const InputVariables: IVariables; // Input variables // Enumerations describing metadata of fields and variables enum DataType { None, Boolean, DateTime, Float, Integer, String, Variant } // Data type enum DataKind { Undefined, Continuous, Discrete } // Data kind enum UsageType { Unspecified, Excluded, Useless, Active, // Usage type of fields

source: d(сумма)
en: d(sum)

source: exports: any; // экспортируемый объект } // функция require принимает идентификатор модуля и возвращает свойство модуля exports interface IRequireFunction {
en: exports: any; // exported object } // require function accepts the module identifier and returns the exports module property interface IRequireFunction {

source: filename?: string; // полный путь к модулю
en: filename?: string; // full path to module

source: import { InputTable, InputTables } from "builtIn/Data"; let inputTable0 = InputTables[0], // Источник данных с порта №1
en: import { InputTable, InputTables } from "builtIn/Data"; let inputTable0 = InputTables[0], // Source of the data from port No 1

source: import { InputVariables } from "builtIn/Data"; // Перебор входных переменных и вывод в консоль значений их свойств: for (let i = 0, c = InputVariables.Count; i < c; i++) {
en: import { InputVariables } from "builtIn/Data"; // Iterating over the input variables and outputting the values of their properties to the console: for (let i = 0, c = InputVariables.Count; i < c; i++) {

source: import { OutputTable } from "builtIn/Data"; // Добавление строки в выходной набор данных OutputTable.Append(); // В поле с именем "COL0" записывается значение true OutputTable.Set("COL0", true); // В поле с индексом 1 записываются текущие Дата/Время OutputTable.Set(1, new Date()); // Проверка, что значение в столбце №2 не определено console.assert(OutputTable.IsNull(0, 2)); console.assert(typeof OutputTable.Get(0, 2) == "undefined"); // Копирование значений первой строки во вторую OutputTable.Append(); for (let i = 0, c = OutputTable.ColumnCount; i < c; i++) {
en: import { OutputTable } from "builtIn/Data"; // Append string to the output data set OutputTable.Append(); // The true value is recorded in the field with "COL0" name OutputTable.Set("COL0", true); // The current Date/Time are recorded in the field with index 1 OutputTable.Set(1, new Date()); // Checking that the value in column No 2 is not defined console.assert(OutputTable.IsNull(0, 2)); console.assert(typeof OutputTable.Get(0, 2) == "undefined"); // Copying the values of the first string to the second one OutputTable.Append(); for (let i = 0, c = OutputTable.ColumnCount; i < c; i++) {

source: import { OutputTable } from "builtIn/Data"; // Импорт модуля функцией require const calcModule = require("builtIn/Calc"); OutputTable.Append(); let currentDate = new Date(); OutputTable.Set(0, calcModule.AddWeek(currentDate, 1)); OutputTable.Set(1, calcModule.AddQuarter(currentDate, -1)); // Импорт через значение по умолчанию import calcDefault from "builtIn/Calc"; OutputTable.Append(); OutputTable.Set(0, calcDefault.Val("1")); OutputTable.Set(1, calcDefault.Str(1e6)); // Импорт всего содержимого модуля import * as calc from "builtIn/Calc"; OutputTable.Append(); OutputTable.Set(0, calc.Count("AAA")); OutputTable.Set(1, calc.Lower("AAA")); // Импорт конкретных функций import { RegExMatchCount, RegExMatchedExp } from "builtIn/Calc"; OutputTable.Append(); OutputTable.Set(0, RegExMatchCount("a+?", "aaa")); OutputTable.Set(1, RegExMatchedExp("a+", "aaa")); // Динамический импорт import("builtIn/Calc").then(calc => {
en: import { OutputTable } from "builtIn/Data"; // Module import by require function const calcModule = require("builtIn/Calc"); OutputTable.Append(); let currentDate = new Date(); OutputTable.Set(0, calcModule.AddWeek(currentDate, 1)); OutputTable.Set(1, calcModule.AddQuarter(currentDate, -1)); // Import using the default value import calcDefault from "builtIn/Calc"; OutputTable.Append(); OutputTable.Set(0, calcDefault.Val("1")); OutputTable.Set(1, calcDefault.Str(1e6)); // Import of the whole module content import * as calc from "builtIn/Calc"; OutputTable.Append(); OutputTable.Set(0, calc.Count("AAA")); OutputTable.Set(1, calc.Lower("AAA")); // Import of certain functions import { RegExMatchCount, RegExMatchedExp } from "builtIn/Calc"; OutputTable.Append(); OutputTable.Set(0, RegExMatchCount("a+?", "aaa")); OutputTable.Set(1, RegExMatchedExp("a+", "aaa")); // Dynamic import import("builtIn/Calc").then(calc => {

source: import { OutputTable, DataType, UsageType } from "builtIn/Data"; let col0 = OutputTable.Columns[0]; // Проверка значения свойства с типом "перечисление" if (col0.DataType == DataType.String) {
en: import { OutputTable, DataType, UsageType } from "builtIn/Data"; let col0 = OutputTable.Columns[0]; // Assertion of the property value with the "enumeration" type if (col0.DataType == DataType.String) {

source: inputTable1 = InputTables[1]; // Источник данных с порта №2 let colOutlook0 = inputTable0.Columns.OUTLOOK, // Получение ссылки на столбец по имени
en: inputTable1 = InputTables[1]; // Source of the data from port No 2 let colOutlook0 = inputTable0.Columns.OUTLOOK, // Getting reference to the column by name

source: let path = require.resolve("foo/foo.js"); delete require.cache[path]; // Очищается кэш модуля "foo/foo.js"
en: let path = require.resolve("foo/foo.js"); delete require.cache[path]; // The cache of the "foo/foo.js" module is cleaned out.

source: loaded: boolean; // загружен ли модуль полностью
en: loaded: boolean; // whether the module is completely loaded

source: msg1...msgN — cписок JavaScript объектов на вывод.
en: msg1...msgN means a list of the JavaScript objects to be displayed.

source: parent?: this; // вызывающий модуль
en: parent?: this; // calling module

source: readonly ColumnCount: number; // Количество столбцов
en: readonly ColumnCount: number; // List of columns

source: readonly Columns: IColumns; // Список столбцов
en: readonly Columns: IColumns; // List of columns

source: readonly Count: number; } // require применяется для импорта модулей CommonJS const require: IRequire; // Представление модуля interface IModule {
en: readonly Count: number; } // require is used for import of CommonJS modules const require: IRequire; // View of module interface IModule {

source: readonly DataKind: DataKind; // Вид данных
en: readonly DataKind: DataKind; // Data kind

source: readonly DataType: DataType; // Тип данных
en: readonly DataType: DataType; // Data type

source: readonly DefaultUsageType: UsageType; // Назначение поля
en: readonly DefaultUsageType: UsageType; // Field usage type

source: readonly DisplayName: string; // Метка
en: readonly DisplayName: string; // Caption

source: readonly Index: number; // Индекс
en: readonly Index: number; // Index

source: readonly IsNull: boolean; // Проверка на Null } // Доступ к итерируемому списку входных переменных по имени и индексу interface IVariableItems extends Iterable<IVariable> {
en: readonly IsNull: boolean; // Check for Null } // Access to iterated list of input variables by name and index interface IVariableItems extends Iterable<IVariable> {

source: readonly Name: string; // Имя
en: readonly Name: string; // Name

source: readonly RowCount: number; // Количество значений
en: readonly RowCount: number; // Number of values

source: readonly RowCount: number; // Количество строк
en: readonly RowCount: number; // Row count

source: readonly Value: boolean | number | string | Date | undefined; // Значение
en: readonly Value: boolean | number | string | Date | undefined; // Value

source: readonly id: string; // идентификатор
en: readonly id: string; // identifier

source: row — индекс строки.
en: row: row index.

source: s = Concat(x,n); // - используется функция калькулятора
en: s = Concat(x,n); // - the calculator function is used

source: title LIKE 'Приключен%'
en: title LIKE 'Adventures%'

source: true undefined null 1 2 3 [object Math] [object Object] function f() { return "something"; } function Append() { [native code] } /a+/ Error: error [object String] [object Boolean] Mon Dec 17 2018 18:40:56 GMT+0300 (RTZ 2 (зима)) [object ArrayBuffer] Symbol() Symbol(aaa) [object Symbol] [object Proxy] 1,[object Object],/^[0..9]+$/ Assertion failed: Assertion failed: 1 != 0 Assertion failed: lie 1 != 0
en: true undefined null 1 2 3 [object Math] [object Object] function f() { return "something"; } function Append() { [native code] } /a+/ Error: error [object String] [object Boolean] Mon Dec 17 2018 18:40:56 GMT+0300 (RTZ 2 (winter)) [object ArrayBuffer] Symbol() Symbol(aaa) [object Symbol] [object Proxy] 1,[object Object],/^[0..9]+$/ Assertion failed: Assertion failed: 1 != 0 Assertion failed: lie 1 != 0

source: true - если установлен флаг "Верхняя граница открыта"; false - если не установлен флаг "Верхняя граница открыта"
en: true if "Upper bound open" checkbox is selected; false if "Upper bound open" checkbox is not selected

source: true - если установлен флаг "Верхняя граница открыта"; false - если не установлен флаг "Верхняя граница открыта".
en: true if "Upper bound open" checkbox is selected; false if "Upper bound open" checkbox is not selected.

source: true - если установлен флаг "Нижняя граница открыта"; false - если не установлен флаг "Нижняя граница открыта"
en: true if "Lower bound open" checkbox is selected; false if "Lower bound open" checkbox is not selected

source: true - если установлен флаг "Нижняя граница открыта"; false - если не установлен флаг "Нижняя граница открыта".
en: true if "Lower bound open" checkbox is selected; false if "Lower bound open" checkbox is not selected.

source: value — значение.
en: value — value.

source: {% content "one" %} Настройка полей новой таблицы.
en: {% content "one" %} Configure fields of the new table

source: {% content "two" %} Представление создаваемой таблицы в виде SQL-запроса.
en: {% content "two" %} Representation of the created table in the form of SQL query

source: {% tabs one="Настройка", two="SQL-запрос" %}
en: {% tabs one="Configure", two="SQL query" %}

source: | |Атрибут с полным именем пользователя|displayName|Имя атрибута в записи пользователя, который содержит полное имя пользователя.
en: | |Attribute with full username|displayName| Attribute name in the user record that includes the full username.

source: | |Порт|389|Номер порта для подключения к серверу LDAP.
en: | |Port|389|Number of the port for the LDAP server connection.

source: | (горизонтальная линия).
en: | (horizontal line).

source: | Округлено — в этом поле выводятся значения, получаемые при применении округления;
en: | Rounded: the values obtained when rounding is used are shown in this field.

source: | Тип данных | Непрерывный | Дискретный | | :- | :-: | :-: | | Вещественный | • | • | | Целый | • | • | | Строковый | | • | | Логический | | • | | Дата/время | • | • |
en: | Data type| Continuous | Discrete | | :- | :-: | :-: | | Real | • | • | | Integer | • | • | | String | | • | | Logical | | • | | Date/time | • | • |

source: | Количество|•|•|•|•|•|•|Показывает общее количество записей в наборе данных, в том числе пустые записи и записи без значения (<null>).| | Минимум|•|•|•|•|•|•|Выводит наименьшее значение по столбцу.
en: | Count|•|•|•|•|•|•|It displays total number of records in the data set, including null records and records without a value (<null>).| | Minimum|•|•|•|•|•|•|It shows the minimum value by column.

source: |Id города|Регион| |-:|:-| |1|Центральный| |2|Северо-западный| |3|Приволжский| |4|Дальневосточный|
en: |City Id|District| |-:|:-| |1|Central| |2|Northwestern| |3|Volga| |4|Far Eastern|

source: |Id|Город| |-:|:-| |1|Москва| |2|Санкт-Петербург| |3|Казань|
en: |Id|City| |-:|:-| |1|Moscow| |2|Saint Petersburg| |3|Kazan|

source: |Атрибут с именем пользователя|sAMAccountName|Имя атрибута в записи пользователя, который содержит имя пользователя используемое при подключении и автоматическом добавлении пользователя Loginom при успешной LDAP аутентификации.
en: |Attribute with username|sAMAccountName|Attribute name in the user record that includes the username used for connection and automatic addition of Loginom user when the LDAP authentification is successful.

source: |Вид агрегации|||||||Комментарий| |:-|:-:|:-:|:-:|:-:|:-:|:-:|:-| | Сумма||•|•||||Суммирует значение всех ячеек в столбце.
en: |Aggregation kind|||||||Comment| |:-|:-:|:-:|:-:|:-:|:-:|:-:|:-| | Sum||•|•||||It sums up values of all cells in the column.

source: |Герметик.Павильон|Герметик.СтройРынок|Обои.Павильон|Обои.СтройРынок|Плитка.Павильон|Плитка.СтройРынок| |-:|-:|-:|-:|-:|-:| |300|200|600|300|100|400|
en: |Sealer.Trade stand|Sealer.StroyRynok|Wallpaper.Trade stand|Wallpaper.StroyRynok|Tiles.Trade stand|Tiles.StroyRynok| |-:|-:|-:|-:|-:|-:| |300|200|600|300|100|400|

source: |Замена|Значение| |-:|:-| |12|Плохо| |24|Удовлетворительно| |36|Хорошо| |48|Отлично| |60|Восхитительно|
en: |Replacement|Value| |-:|:-| |12|Poor| |24|Satisfactory| |36|Good| |48|Excellent| |60|Perfect|

source: |Значение исходных данных|Новое значение| |-:|:-| |12|Плохо| |15|15| |24|Удовлетворительно| |35|35| |48|Отлично| |73|73|
en: |Source data value|New value| |-:|:-| |12|Poor| |15|15| |24|Satisfactory| |35|35| |48|Excellent| |73|73|

source: |Значение исходных данных|Новое значение| |-:|:-| |12|Плохо| |15|<null>| |24|Удовлетворительно| |35|<null>| |48|Отлично| |73|<null>|
en: |Source data value|New value| |-:|:-| |12|Poor| |15|<null>| |24|Satisfactory| |35|<null>| |48|Excellent| |73|<null>|

source: |Значение исходных данных|Новое значение| |-:|:-| |12|Плохо| |15|Плохо| |24|Удовлетворительно| |35|Хорошо| |48|Отлично| |73|73|
en: |Source data value|New value| |-:|:-| |12|Poor| |15|Poor| |24|Satisfactory| |35|Good| |48|Excellent| |73|73|

source: |Значение исходных данных|Новое значение| |-:|:-| |12|Плохо| |15|Плохо| |24|Удовлетворительно| |35|Хорошо| |48|Отлично| |73|Вне оценочного диапазона|
en: |Source data value|New value| |-:|:-| |12|Poor| |15|Poor| |24|Satisfactory| |35|Good| |48|Excellent| |73|Out of estimation range|

source: |Имя столбца|Номер класса|Уникальное значение| |-|-|-| |COL4|0|жен| |COL4|1|муж| |COL4|2|NULL| |COL4|2|| |COL6|0|Бронзовый| |COL6|1|Серебряный| |COL6|2|Золотой| |COL6|2|Платиновый|
en: |Column name|Class number|Unique value| |-|-|-| |COL4|0|female| |COL4|1|male| |COL4|2|NULL| |COL4|2|| |COL6|0|Bronze| |COL6|1|Silver| |COL6|2|Gold| |COL6|2|Platinum|

source: |Имя столбца|Описание| |:-|:-| |Идентификатор интервалов|Имя поля| |Номер интервала|Порядковый номер интервала| |Метка|Метка интервала, которая задается шаблоном в мастере настройки| |Нижняя граница|Нижняя граница интервала| |Верхняя граница|Верхняя граница интервала| |Нижний предел интервала включительно|false – граница интервала не входит в интервал; true – граница интервала входит в интервал.| |Верхний предел интервала включительно|false – граница интервала не входит в интервал; true – граница интервала входит в интервал.| |Нижняя граница диапазонов открыта|true – если флаг «Нижняя граница открыта» установлен; false – если флаг «Нижняя граница открыта» не установлен.| |Верхняя граница диапазонов открыта|true – если флаг «Верхняя граница открыта» установлен; false – если флаг «Верхняя граница открыта» не установлен.| |Значение вне диапазона | Значения, которые не попали ни в один диапазон: -1 – значение меньше наименьшей границы диапазона; 0 – значение входит в один из интервалов; 1 – значение больше верхней границы диапазона.|
en: |Column name|Description| |:-|:-| |Bins identifier|Field name| |Bin number|Index bin number| |Caption|Bin caption that is set by the wizard template| |Lower bound|Lower bin bound| |Upper bound|Upper bin bound| |Lower bin bound inclusive|false: the bin bound is not included into the bin; true: the bin bound is included into the bin.| |Upper bin bound inclusive|false: the bin bound is not included into the bin; true: the bin bound is included into the bin.| |Lower bin bound open|true: if «Lower bin bound open» checkbox is selected; false: if «Lower bin bound open» checkbox is not selected.| |Upper bin bound open|true: if «Upper bin bound open» checkbox is selected; false: if «Upper bin bound open» checkbox is not selected.| |Out of bin value| The values that are not included into bins: -1 – the value that is less than the least bin bound; 0 – the value that is included into one of the bins; 1 – the value that exceeds the upper bin bound.|

source: |Имя|Id города| |:-|-:| |Андрей|1| |Леонид|2| |Сергей|1| |Григорий|4|
en: |Name|City Id| |:-|-:| |Andrey|1| |Leonid|2| |Sergey|1| |Gregory|4|

source: |Имя|Id города| |:-|-:| |Григорий|4|
en: |Name|City Id| |:-|-:| |Gregory|4|

source: |Имя|Id города|Город| |:-|-:|:-| |Андрей|1|Москва| |Андрей|1|Санкт-Петербург| |Андрей|1|Казань| |Леонид|2|Москва| |Леонид|2|Санкт-Петербург| |Леонид|2|Казань| |Сергей|1|Москва| |Сергей|1|Санкт-Петербург| |Сергей|1|Казань| |Григорий|4|Москва| |Григорий|4|Санкт-Петербург| |Григорий|4|Казань|
en: |Name|City Id|City| |:-|-:|:-| |Andrey|1|Moscow| |Andrey|1|Saint Petersburg| |Andrey|1|Kazan| |Leonid|2|Moscow| |Leonid|2|Saint Petersburg| |Leonid|2|Kazan| |Sergey|1|Moscow| |Sergey|1|Saint Petersburg| |Sergey|1|Kazan| |Gregory|4|Moscow| |Gregory|4|Saint Petersburg| |Gregory|4|Kazan|

source: |Имя|Id города|Город| |:-|-:|:-| |Андрей|1|Москва| |Леонид|2|Санкт-Петербург| |Сергей|1|Москва|
en: |Name|City Id|City| |:-|-:|:-| |Andrey|1|Moscow| |Leonid|2|Saint Petersburg| |Sergey|1|Moscow|

source: |Имя|Id города|Город| |:-|-:|:-| |Андрей|1|Москва| |Леонид|2|Санкт-Петербург| |Сергей|1|Москва| |Григорий|4|&#60;null>|
en: |Name|City Id|City| |:-|-:|:-| |Andrey|1|Moscow| |Leonid|2|Saint Petersburg| |Sergey|1|Moscow| |Gregory|4|&#60;null>|

source: |Имя|Id города|Город| |:-|-:|:-| |Андрей|1|Москва| |Леонид|2|Санкт-Петербург| |Сергей|1|Москва| |Григорий|4|&#60;null>| |&#60;null>||Казань|
en: |Name|City Id|City| |:-|-:|:-| |Andrey|1|Moscow| |Leonid|2|Saint Petersburg| |Sergey|1|Moscow| |Gregory|4|&#60;null>| |&#60;null>||Kazan|

source: |Имя|Id города|Город| |:-|-:|:-| |Андрей|1|Москва| |Сергей|1|Москва| |Леонид|2|Санкт-Петербург| |&#60;null>|&#60;null>|Казань|
en: |Name|City Id|City| |:-|-:|:-| |Andrey|1|Moscow| |Sergey|1|Moscow| |Leonid|2|Saint Petersburg| |&#60;null>|&#60;null>|Kazan|

source: |Имя|Id города|Город|Id| |:-|-:|:-|:-| |Андрей|1|Москва|1| |Леонид|2|Санкт-Петербург|2| |Сергей|1|Москва|1| |Григорий|4|&#60;null>|| |&#60;null>||Казань|3|
en: |Name|City Id|City|Id| |:-|-:|:-|:-| |Andrey|1|Moscow|1| |Leonid|2|Saint Petersburg|2| |Sergey|1|Moscow|1| |Gregory|4|&#60;null>|| |&#60;null>||Kazan|3|

source: |Имя|Id города|Город|Регион| |:-|-:|:-|:-| |Андрей|1|Москва|Центральный| |Леонид|2|Санкт-Петербург|Северо-западный| |Сергей|1|Москва|Центральный| |Григорий|4|&#60;null>|Дальневосточный|
en: |Name|City Id|City|District| |:-|-:|:-|:-| |Andrey|1|Moscow|Central| |Leonid|2|Saint Petersburg|Northwestern| |Sergey|1|Moscow|Central| |Gregory|4|&#60;null>|Far Eastern|

source: |КТУ|Кластер| |:-|-:| |> 0.8|1| |> 0.8|1| |0.5 - 0.8|2| |0.5 - 0.8|2| |0.2 - 0.5|3| |< 0.2|4|
en: |Labor participation coefficient|Cluster| |:-|-:| |> 0.8|1| |> 0.8|1| |0.5 - 0.8|2| |0.5 - 0.8|2| |0.2 - 0.5|3| |< 0.2|4|

source: |Павильон.Герметик|Павильон.Обои|Павильон.Плитка|СтройРынок.Герметик|СтройРынок.Обои|СтройРынок.Плитка| |-:|-:|-:|-:|-:|-:| |300|600|100|200|300|400|
en: |Trade stand.Sealer|Trade stand.Wallpaper|Trade stand.Tiles|StroyRynok.Sealer|StroyRynok.Wallpaper|StroyRynok.Tiles| |-:|-:|-:|-:|-:|-:| |300|600|100|200|300|400|

source: |Параметр|Значение по умолчанию|Описание| |:-|:-|:-| |Выполнение запрещено|true|Параметр запрещает выполнение узла Выполнение программы, если выставлено значение true, и позволяет выполнять узел при значении false|
en: |Parameter|Default value|Description| |:-|:-|:-| |Execution forbidden|true|The parameter forbids execution of the Program execution node if true value is set, and enables to execute the node when the value is false|

source: |Параметр|Значение по умолчанию|Описание| |:-|:-|:-| |Личные данные пользователя|UserStorage|Параметр отвечает за название каталога, в котором располагаются личные каталоги пользователей и создаваемые в Общие папки| |Резервные копии сессии|SessionBackup|Параметр задает название каталога для резервных копий сессий|
en: |Parameter|Default value|Description| |:-|:-|:-| |User data|UserStorage|The parameter is required for the name of the directory in which private directories of users created in Shared folders are located| |Session backups|SessionBackup|The parameter enables to set the name of the directory for session backups|
